# dict - словари. Представляет из себя структуру данных. Ассоциативный массив
# Предназначен для хранения произвольных объектов с доступом по ключу
# Аналогичен списку, но индексы мы назначаем сами, а не компьютер
#  Данные хранятся в формате ключ-значение.

# Создане словаря
d1 = dict()
print(type(d1))

d2 = {}
print(type(d2))

# Создание словаря с заданными значениями
d1 = dict(Ivan = "manager", Mark = "worker", Kolyas = "manager")
print(d1)

d2 = {'Pavel': "Energo", 'Muhammet': "PK4"}
print(d2, "\n")

# Добавление/удаление элемента словаря
d1["Sergei"] = "Rukovoditel"
print(d1)

d1["Anton"] = "Storozh"
d1["Vlad"] = "Storozh"
print(d1)

del d1["Anton"]
print(d1)

# Работа со словарем
# Проверка, есть ли ключ в словаре
print("Kolyas" in d1, "Anton" in d1)

# Получение значения по ключу
print(d1["Sergei"], "\n")
print(d1.get("Ivan"))

# Методы словарей
print(d1.__sizeof__())

d3 = d1.copy()
print(d3)
d3.clear()
print(d3, "\n")

# Получение всех элементов словаря в отформатированном виде
print("тут ",d1.items(), "\n")

# Получение всех КЛЮЧЕЙ словаря
print(d1.keys(), "\n")

# Вынимание значения элемента по ключу из словаря
print(d1.pop("Ivan"))
print(d1.items(), "\n")

# Вынимание ПОСЛЕДНЕЙ пары из словаря.
print(d1.popitem())
print(d1.items(), "\n")

# Вверху показывает ошибку, что d3 пустой и вынимать нечего
# print(d3)
# d3.popitem()

d4 = d1.copy()
# Получает значение по ключу. Если значения нет - создает его
print(d4.setdefault("Ivan"))
print(d4.setdefault("Mark"))
print(d4.setdefault("Igor", "HH"))
print(d4)

# Обновление элемента. Изменяет существующий. Если такого нет - добавляет
d5 = {"A1":"123", "A2":"234"}
d5.update({"A1": "55555", "A3": "345"})
print(d5)

# Возвращение значений элементов словаря
d6 = {"A1": "123", "A2": "234"}
d6.update({"A3": "345"})
print(d6)
print(d6.values())



















