# Вывод данных

# Вывод в консоль
print("Hello")
print("Hello, " + "world")
print("Age: " + str(23), "\n")

# Перечисление по-умолчанию через запятую делает пробелы.
print("A", "B", "C")
# Есть возможность указать разделитель
print("A", "B", "C", "\n", sep="$$")

# Окончание строки по-умолчанию \n
for i in range(3):
    print("i: " + str(i))
# Окончание строки можно настраивать
for i in range(3):
    print("[i: " + str(i), "]", end = " xxx ")
print("\n")

# Ввод данных с клавиатуры
# a = input()
# print(a)

# Если считывается число, то его можно сразу передать в функцию int()
# val = int(input())
# print(val)
# print(type(val))

# Для вывода строки-приглашегия, можно добавить
# temp = int(input("input number: "))
# print(temp)

# Преобразование строки чисел в список можно с помощью метода split()
# по умолчанию разделителем будет пробел. Например 1 2 3 4 5 6 7 8
# lst = input().split()
# print(lst)

# разделитель можно назначить любым. Например 1-2-3-4-5-6-7-8
# lst = input().split("-")
# print(lst)

# Список чисел можно сразу приводит к типу int
nums = map(int, input().split())
print(list(nums))




