# Вывести все элементы меньше этого
a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]

for i in range(len(a)):
    if a[i] <= 5:
        print(a[i], end = " ")
print('\n')

# Даны списки. Вернуть список, содержащий общие элементы
a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
c = []

for i in a:
    for j in b:
        if i == j:
            c.append(i)
print(c)
del a,b,c,i,j

# Отсортировать словарь по значению в порядке возрастания и убывания
d = {"a": 1, "b": 255, "c": 44}
print(d)







